In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv('../datasets/titanic.csv')

In [3]:
titanic.drop(['PassengerId', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [4]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [62]:
print(titanic.Age.min())
print(titanic.Age.max())

0.42
80.0

In [5]:
bins = [0, 9, 18, 40, 60, 81]   # 나이를 구분하는 포인트 지정
labels = ['어린이', '청소년', '20/30대', '40/50대', '60대 이상']   # bins 보다 1개 더 적게 정의

In [6]:
titanic['Age_band_cut'] = pd.cut(titanic['Age'], bins=bins, labels=labels)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Age_band_cut
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,20/30대
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,20/30대
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,20/30대
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,20/30대
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,20/30대

In [7]:
titanic.Age_band_cut.value_counts()

20/30대    425
40/50대    128
청소년        77
어린이        62
60대 이상     22
Name: Age_band_cut, dtype: int64

In [8]:
titanic.Age_band_cut.value_counts().to_frame().style.background_gradient(cmap='viridis')

In [11]:
labels = ['어린이', '청소년', '20/30대', '40/50대', '60대 이상']
titanic['Age_band_qcut'] = pd.qcut(titanic.Age, q=5, labels=labels)

In [12]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Age_band_cut,Age_band_qcut
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,20/30대,청소년
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,20/30대,40/50대
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,20/30대,20/30대
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,20/30대,40/50대
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,20/30대,40/50대

In [35]:
titanic.Age_band_qcut.value_counts()

어린이       164
40/50대    144
60대 이상    142
청소년       137
20/30대    127
Name: Age_band_qcut, dtype: int64

In [38]:
titanic[titanic.Age_band_qcut == '어린이'].max()['Age']

19.0

In [39]:
titanic['Age_band_qcut'] = pd.qcut(titanic.Age, q=5, labels=['A', 'B', 'C', 'D', 'E'])

In [40]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_band_cut,Age_band_qcut
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,20/30대,B
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,20/30대,D
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,20/30대,C
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,20/30대,D
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,20/30대,D

In [41]:
titanic.Age_band_qcut.value_counts().to_frame().style.background_gradient(cmap='viridis')

In [58]:
pd.Categorical([1, 2, 3, 1, 2, 3, 'a', 'b', 'c', 'a', 'b', 'c', np.nan])

[1, 2, 3, 1, 2, ..., 'c', 'a', 'b', 'c', NaN]
Length: 13
Categories (6, object): [1, 2, 3, 'a', 'b', 'c']

In [56]:
pd.Categorical([1, 2, 3, 1, 2, 3, 'a', 'b', 'c', 'a', 'b', 'c', np.nan]).codes

array([ 0,  1,  2,  0,  1,  2,  3,  4,  5,  3,  4,  5, -1], dtype=int8)

In [57]:
pd.Categorical(['a', 'b', 'c', 'a', 'b', 'c'], ordered=True, categories=['c', 'b', 'a'])

['a', 'b', 'c', 'a', 'b', 'c']
Categories (3, object): ['c' < 'b' < 'a']

In [109]:
titanic['Pclass'] = titanic.Pclass.astype('category')

In [49]:
titanic.Pclass.cat.set_categories([3, 2, 1], ordered=True)

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: category
Categories (3, int64): [3 < 2 < 1]

In [50]:
titanic['Pclass'] = titanic.Pclass.cat.set_categories([3, 2, 1], ordered=True)

In [51]:
titanic.Pclass.sort_values()

0      3
501    3
502    3
503    3
508    3
      ..
710    1
711    1
712    1
224    1
445    1
Name: Pclass, Length: 891, dtype: category
Categories (3, int64): [3 < 2 < 1]